app/Http/Controllers/UserController.php

delete from `users` where `id` = 3
---
    public function destroy(User $user)
    {
        $user->delete ();