app/Repositories/ImageRepository.php

insert into `images` (`description`, `category_id`, `adult`, `name`, `user_id`, `updated_at`, `created_at`) values ('', '1', 0, 'pW1JiTAkRDnpM4K1acdbGH4DfKbUp2zrRs55B2uC.jpeg', 1, '2019-12-21 04:24:43', '2019-12-21 04:24:43')
---
    public function store($request)
    {
        // Save image
        $path = basename ($request->image->store('images'));

        // Save thumb
        $image = InterventionImage::make ($request->image)->widen (500)->encode ();
        Storage::put ('thumbs/' . $path, $image);

        // Save in base
        $image = new Image;
        $image->description = $request->description;
        $image->category_id = $request->category_id;
        $image->adult = isset($request->adult);
        $image->name = $path;
        $request->user()->images()->save($image);

select * from `images` order by `created_at` desc limit 3 offset 0
select count(*) as aggregate from `images`
---
    public function getAllImages()
    {
        return Image::latestWithUser()->paginate (config ('app.pagination'));

select * from `images` where exists (select * from `users` where `images`.`user_id` = `users`.`id` and `id` = 1) order by `created_at` desc limit 8 offset 0
select count(*) as aggregate from `images` where exists (select * from `users` where `images`.`user_id` = `users`.`id` and `id` = 1)
---
    public function getImagesForUser($id)
    {
        return Image::latestWithUser ()->whereHas ('user', function ($query) use ($id) {
            $query->whereId ($id);
        })->paginate(config('app.pagination'));

select * from `images` where exists (select * from `albums` inner join `album_image` on `albums`.`id` = `album_image`.`album_id` where `images`.`id` = `album_image`.`image_id` and `slug` = 'test') order by `created_at` desc limit 8 offset 0
select count(*) as aggregate from `images` where exists (select * from `albums` inner join `album_image` on `albums`.`id` = `album_image`.`album_id` where `images`.`id` = `album_image`.`image_id` and `slug` = 'test')
---
    public function getImagesForAlbum($slug)
    {
        return Image::latestWithUser ()->whereHas ('albums', function ($query) use ($slug) {
            $query->whereSlug ($slug);
        })->paginate(config('app.pagination'));

select `name` from `images`
---
    public function getOrphans()
    {
        return collect (Storage::files ('images'))->transform(function ($item) {
            return basename($item);
        })->diff (Image::select ('name')->pluck ('name'));