app/Repositories/UserRepository.php

    public function update(User $user, Request $request)
    {
        if($user->hasVerifiedEmail() && !$request->verified) {
            $request->merge(['email_verified_at' => null]);
        }
        if(!$user->hasVerifiedEmail() && $request->verified) {
            $request->merge(['email_verified_at' => new Carbon]);
        }

        $user->adult = $request->adult;
        $user->update ($request->all());
---
update `users` set `settings` = '{\"adult\":\"on\",\"pagination\":3}', `users`.`updated_at` = '2019-12-21 14:19:24' where `id` = 1